<?php 
    echo'
    <table cellspacing=0 cellpadding=0 width="100%" border=0>
        <tr>
            <td colspan="3" background="'.$img.'/img/menu_h_fd.gif"><img height=6 src="'.$img.'/img/pixel.gif" width="100%"></td>
        </tr>
        <tr>  
             <td width=16 background="'.$img.'/img/menu_g_fd.gif">&nbsp;</td>
             <td background="'.$img.'/img/menu_fd.gif">
                <table cellspacing=0 cellpadding=4 width="100%" border=0>
                    <tr>
                        <td align="center">Имя</td>
                        <td width=70>Записи</td>
                        <td width=140>Последняя запись</td>
                        <td width=70>Комментарии</td>
                        <td width=140>Последний комментарий</td>
                        <td width=70>Просмотров</td>
                    </tr>
                </table>
            </td> 
            <td width=16 background="'.$img.'/img/menu_d_fd.gif">&nbsp;</td>
        </tr>
        <tr>  
            <td colspan="3" background="'.$img.'/img/menu_b_fd.gif"><img height=6 src="'.$img.'/img/pixel.gif"></td>
        </tr>
    </table>';

    echo'
    <table cellspacing=0 cellpadding=0 width="100%" background="'.$img.'/img/story-content-bg2.gif" border=0>
        <TR>
            <TD width=20 background="'.$img.'/img/center_hg.gif"><IMG height=20 src="'.$img.'/img/pixel.gif" width=20></TD>
            <TD background="'.$img.'/img/center_h_fd.gif"><IMG height=20 src="'.$img.'/img/pixel.gif" width=20></TD>
            <TD width=20 background="'.$img.'/img/center_hd.gif"><IMG height=20 src="'.$img.'/img/pixel.gif" width=20></TD>
        </TR>
        <TR>
            <TD width=20 background="'.$img.'/img/center_g_fd.gif"><IMG height=20 src="'.$img.'/img/pixel.gif" width=20></TD>
            <TD>
                <table cellspacing=1 cellpadding=1 width="100%">';

echo '
Игрок, пользующийся дневниками, обязан соблюдать Законы игры! Если более развернуто, пользователь дневников должен знать, что:<br>
<br>
1. На все тексты и изображения, опубликованные в записях или комментариях дневников, распространяется действие авторского права. Все заимствованные материалы должны иметь указание имени автора, если оно указано на сайте-источнике, а при невозможности его установления — значок копирайта (с). Гиперссылки на заимствованные материалы, размещенные ранее в Интернете, приветствуются, а в том случае, если автор заявит об их необходимости — требуются обязательно. Приписывать себе авторство чужих текстов или изображений категорически запрещается.<br><br>
2. Размещение в записях или комментариях дневников фотографий, на которых изображены другие люди, допускается лишь до тех пор, пока изображенный на фото человек не заявит о своем нежелании размещения этого фото на сайте. Спорные ситуации решаются Администрацией после обращения людей, изображенных на фото.<br>  <br>
3. В дневниках запрещены:<br>
- оскорбления других игроков<br>
- оскорбления кого-либо на почве политических или религиозных взглядов, национальности и этнической принадлежности, а также любые попытки разжигания вражды, призывы к насилию над кем-либо<br>
- любые формы пропаганды фашизма, идеологии расового превосходства в целом, проявления ксенофобии<br>
- попытки распространения наркотиков, рецепты изготовления и советы по употреблению наркотических веществ<br>
- попытки распространения оружия и взрывчатых веществ, описание способов их изготовления, либо применения<br>
- спам — массовые однотипные комментарии в дневнике<br>
- публикация любых изображений и текстов порнографического содержания<br>
- размещение изображений, содержащих фрагменты сцен суицида, насилия над человеком или животными, а также последствий этих действий, описание средств и способов насилия и суицида, любое подстрекательство к их совершению<br>
- описание способов получения неправомерного доступа к компьютерной информации, распространение вредоносного программного кода или ссылок на место его хранения в Сети.<br>
<br><br>
В случае нарушения норм поведения, установленных настоящими Правилами и Законами, Администрация вправе закрыть, отредактировать или удалить записи или комментарии в любом дневнике, а также применить санкции к игроку.<br>
<br><br>
За рамками Правил:<br>
Несколько советов для того, чтобы избежать конфликта в дневниках:<br>
- не читать того, что вам не нравится (либо читать молча);<br>
- не писать того, что может вызвать конфликт (либо никому не показывать);<br>
- настоятельно рекомендуется прятать большие картинки (более 900 точек по стороне или более 0.5Мб) и тексты под кат.<br>';

echo'                </table>
            </TD>
            <TD width=20 background="'.$img.'/img/center_d_fd.gif"><IMG height=20 src="'.$img.'/img/pixel.gif" width=20></TD>
        </TR>
        <TR>
            <TD width=20><IMG height=20 src="'.$img.'/img/center_bg.gif" width=20></TD>
            <TD background="'.$img.'/img/center_b_fd.gif">&nbsp;</TD>
            <TD width=20><IMG height=20 src="'.$img.'/img/center_b_d.gif" width=20></TD>
        </TR>
    </TABLE>';

?>