<?php
if (function_exists('OpenTable'))
{
  OpenTable('title');
  $check = date('d:m');
  echo '<table width=100%><tr><td align="right">';
  echo '</td><td align=left><b><font face="Tahoma" color="#FFFF00">';
  switch($check)
  {
	case '01:01':
	{
		echo 'Новый год | (1874 г.) Манифест о введении всеобщей воинской повинности и Устав воинской повинности | Январь (Просинец). Если в январе частые снегопады и метели, то в июле будут частые дожди.';
		break;
	}
	case '03:01':
	{
		echo 'День рождения профессора Оксфордского Университета Джона Р.Р.Толкиена(1892г.)';
		break;
	}
	case '07:01':
	{
		echo 'Рождество Христово (православное) | На Рождество метель - пчелы хорошо роиться будут, на Рождество иней - урожай на хлеб; небо в звездах - урожай на горох. Если на Рождество путь хорош - к урожаю гречки.';
		break;
	}
	case '14:01':
	{
		echo 'Старый Новый год';
		break;
	}
	case '25:01':
	{
		echo 'Татьянин день (день студентов) | Татьянин день. Если в этот день солнышко проглянет - к ранней весне, если снег - к дождливому лету.';
		break;
	}
	case '01:02':
	{
		echo 'Февраль (Лютень). Февраль холодный и сухой - август жаркий. | Какой первый день февраля - такие и остальные.';
		break;
	}
	case '14:02':
	{
		echo 'Воскресение Гэндальфа. (3019 г. III эпохи) | День св. Валентина';
		break;
	}
	case '16:02':
	{
		echo 'Восточный новый год';
		break;
	}
	case '25:02':
	{
		echo 'Первая битва у изенских бродов (3019 г. III эпохи). Смерть Теодрена, сына Теодена, короля Рохана (3019 г. III эпохи)';
		break;
	}
	case '26:02':
	{
		echo 'Смерть Боромира, сына Денетора, наместника Гондора';
		break;
	}
	case '30:02':
	{
		echo 'Великое собрание энтов перед походом на Изенгард (3019 г. III эпохи)';
		break;
	}
	case '01:03':
	{
		echo 'День рождения Арагорна (2931 г. III эпохи) | Смерть Арагорна (120 г. IV эпохи)';
		break;
	}
	case '02:03':
	{
		echo 'Вторая битва у изенских бродов (3019 г. III эпохи)';
		break;
	}
	case '03:03':
	{
		echo 'Битва при Хорнбурге (3019 г. III эпохи) | Разрушение Ортханка (3019 г. III эпохи)';
		break;
	}
	case '08:03':
	{
		echo 'Арагорн призывает клятвопреступников у камня Эреха идти с ним.(3019 г. III эпохи) | Международный женский день';
		break;
	}
	case '11:03':
	{
		echo 'Первый штурм Лориэна (3019 г. III эпохи)';
		break;
	}
	case '15:03':
	{
		echo 'Пеленорская битва (3019 г. III эпохи) | Второй штурм Лориэна (3019 г. III эпохи) | Смерть Теодена, короля Рохана (3019 г. III эпохи) | Смерть Денетора, наместника Гондора (3019 г. III эпохи)';
		break;
	}
	case '17:03':
	{
		echo 'Первая битва в Дейле (3019 г. III эпохи) | Смерть Бранда, короля Эсгарота (3019 г. III эпохи) | Смерть Даина Железностопа, короля Одинокой Горы (3019 г. III эпохи)';
		break;
	}
	case '22:03':
	{
		echo 'Третий и последний штурм Лориэна (3019 г. III эпохи)';
		break;
	}
	case '25:03':
	{
		echo 'Битва перед черными воротами (3019 г. III эпохи) | Уничтожение Кольца. | Падение Барад-дура, уход Саурона(3019 г. III эпохи) | День рождения Эланор Прекрасной, дочери Сэма Гэмджи (3021 г. III эпохи)';
		break;
	}
	case '27:03':
	{
		echo 'Вторая битва в Дэйле (3019 г. III эпохи)';
		break;
	}
	case '28:03':
	{
		echo 'Штурм Дол-Гулдура.(3019г. 3 эпохи)';

		break;
	}
	case '01:04':
	{
		echo 'Первое апреля! - День смеха | Апрель (Цветень).';
		break;
	}
	case '06:04':
	{
		echo 'День рождения Сэма Гэмджи.';
		break;
	}
	case '08:04':
	{
		echo 'Празднество на Кормалленском поле (3019 г. III эпохи)';
		break;
	}
	case '12:04':
	{
		echo 'День космонавтики';
		break;
	}
	case '15:04':
	{
		echo 'Битва на Полях Келебранта (2509 г. III эпохи) | Встреча Кириона и Эорла (2509 г. III эпохи)';
		break;
	}
	case '01:05':
	{
		echo 'Коронация Арагорна (3019 г. III эпохи) | Свадьба Сэма Гэмджи и Рози Недоселок (3020 г. III эпохи) | Праздник весны и труда | Май (Травень). В мае два холода - черемуха цветет и дуб распускается.';
		break;
	}
	case '09:05':
	{
		echo 'День Победы (Победа в ВОВ 1941-1945 гг.)';
		break;
	}
	case '01:06':
	{
		echo 'Международный день защиты детей | Июнь (Разноцвет).';
		break;
	}
	case '21:06':
	{
		echo 'День Преполовения у хоббитов (Лит. Отмечался с 20 по 22-е)';
		break;
	}
	case '22:06':
	{
		echo 'День памяти и скорби';
		break;
	}
	case '25:06':
	{
		echo 'Король Элессар находит молодое Белое Древо (3019 г. III эпохи)';
		break;
	}
	case '01:07':
	{
		echo 'Свадьба Арагорна и Арвен (3019 г. III эпохи) | Июль (Грозовик).';
		break;
	}
	case '13:07':
	{
		echo 'Битва с Колесничими (1944 г. III эпохи) | Гибель Ондогера, короля Гондора (1944 г. III эпохи)';
		break;
	}
	case '15:07':
	{
		echo 'Вторая битва с Колесничими (1944 г. III эпохи)';
		break;
	}
	case '19:07':
	{
		echo 'Погребальный поезд Теодена отправляется в Эдорас(3019 г. III эпохи)';
		break;
	}
	case '01:08':
	{
		echo 'Август (Серпень)';
		break;
	}
	case '07:08':
	{
		echo 'Погребальный поезд Теодена прибывает в Эдорас (3019 г. III эпохи)';
		break;
	}
	case '25:08':
	{
		echo 'Погребение короля Теодена (3019 г. III эпохи)';
		break;
	}
	case '02:09':
	{
		echo 'День смерти Дж.Р.Р. Толкиена (1973)';
		break;
	}
	case '18:09':
	{
		echo 'Бегство Гэндальфа из Ортханка (3018 г. III эпохи)';
		break;
	}
	case '21:09':
	{
		echo 'День первой публикации "Хоббита" (1937)';
		break;
	}
	case '22:09':
	{
		echo 'День рождения Бильбо и Фродо (2890 и 2968 гг. III эпохи) | Сэм Гэмджи отправляется за море (61 г. IV эпохи)';
		break;
	}
	case '29:09':
	{
		echo 'Последний Корабль покидает Средиземье. Конец III эпохи (3021 г. III эпохи)';
		break;
	}
	case '04:10':
	{
		echo 'Сражение в Ирисной Низине (2 г. III эпохи) | Гибель Исилдура, сына Элендила (2 г. III эпохи)';
		break;
	}
	case '29:10':
	{
		echo 'Совет у Элронда (3018 г. III эпохи)';
		break;
	}
	case '02:11':
	{
		echo 'День роханского рога в Бэкланде';
		break;
	}
	case '03:11':
	{
		echo 'Приреченская битва. Смерть Сарумана. Конец войны Кольца (3019 г. III эпохи)';
		break;
	}
	case '19:11':
	{
		echo 'День СМЕХА в Средиземье';
		break;
	}
	case '29:11':
	{
		echo 'День смерти Эдит Толкиен (1971)';
		break;
	}
	case '24:12':
	{
		echo 'Новый год по хоббичьему календарю (Юл. Отмечался с 21 по 26-е)';
		break;
	}
  }
  echo '</font></b></td>';

  echo '<td width=270 align=right><font face="verdana, tahoma" size="1" color="FFFF00">';

  $da = getdate();
  $newyear = GetGameCalendar_Year($da['year'],$da['mon'],$da['mday']);
  $newmonth = GetGameCalendar_Month($da['year'],$da['mon'],$da['mday']);

  echo '['.date('H:i').'] ';

  if ($newmonth==1) 		echo 'Нарвиниэ (1 месяц), '.$newyear.' г.IV Эпохи';
  elseif ($newmonth==2) 		echo 'Ненимэ (2 месяц), '.$newyear.' г.IV Эпохи';
  elseif ($newmonth==3) 		echo 'Сулимэ (3 месяц), '.$newyear.' г.IV Эпохи';
  elseif ($newmonth==4) 		echo 'Вирэссэ (4 месяц), '.$newyear.' г.IV Эпохи';
  elseif ($newmonth==5) 		echo 'Лотэссэ (5 месяц), '.$newyear.' г.IV Эпохи';
  elseif ($newmonth==6) 		echo 'Нариэ (6 месяц), '.$newyear.' г.IV Эпохи';
  elseif ($newmonth==7) 		echo 'Кермиэ (7 месяц), '.$newyear.' г.IV Эпохи';
  elseif ($newmonth==8) 		echo 'Уримэ (8 месяц), '.$newyear.' г.IV Эпохи';
  elseif ($newmonth==9) 		echo 'Йаванниэ (9 месяц), '.$newyear.' г.IV Эпохи';
  elseif ($newmonth==10) 		echo 'Наркуэлиэ (10 месяц), '.$newyear.' г.IV Эпохи';
  elseif ($newmonth==11) 		echo 'Хисимэ (11 месяц), '.$newyear.' г.IV Эпохи';
  elseif ($newmonth==12) 		echo 'Рингарэ (12 месяц), '.$newyear.' г.IV Эпохи';

  echo '</font></td></tr></table>';
  OpenTable('close');
}

if (!defined("MODULE_ID"))
{
	define("MODULE_ID","undefined");
}

if ($char['name']=='The_Elf' OR $char['name']=='blazevic' OR $char['name']=='betatester')
{
	$exec_time = $MyTimer->GetTime(5);
	echo '<font size=1 face="verdana, tahoma"><center>Время вып.скрипта: <b><font color=ff0000>' . $exec_time . '</font></b> сек   |   Количество запросов: <b><font color=ff0000>'.$numsql.'</font></b>   |   Время запросов: <b><font color=ff0000>' . $time_mysql_query . '</font></b> сек ('.round($time_mysql_query*100/$exec_time,2).'%) | Module_id: '.MODULE_ID.'</center></font>';
}

echo '</body></html>';
while (ob_get_level() > 0) {
   ob_end_flush();
}
?>